GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
TERM_PARAM term_param=
{
	{0x11,0x22,0x33,0x44,0x55,0x66},
	{'T','C','B','B','D'},
	{'T','W','7','0','1','-','B','D',0,0,0,0,0,0,0,0,0,0,0,0},
	{0x00,0x99,0xaa,0xbb,0xcc,0xdd,0xee},
};


#define FLAG_DISABLE_REPORT_INVALID	1	/*设备非法*/
#define FLAG_DISABLE_REPORT_AREA	2	/*区域内禁止上报*/

static uint32_t flag_disable_report=0; /*禁止上报的标志位*/





/*初始化一个参数表*/
static void config_init(void)
{
	struct tree_config *root_cfg;
	struct tree_config *cfg;
	char *key,*val;
	int indent,last_indent;
	int i;

	char *param[]=
	{
		"\tversion=13022200",
		"\tterminal=",
		"\t\tmobileno=1234567890"
		"\tid_0001=30",
		"\tid_0002=5",
		"\tid_0003=3",
		


	};
	char buf[128];
	
	
	root_cfg=rt_calloc(1,sizeof(struct config *));
	if(!root_cfg)
	{
		rt_kprintf("\rroot_cfg err\r\n");
		return;
	}
	root_cfg->key = rt_malloc(strlen("root")+1);
	strcpy(root_cfg->key,"root");
	root_cfg->val = malloc(strlen("") + 1);	
	RT_ASSERT(root_cfg->val);	
	strcpy(root_cfg->val, "");
	cfg=root_cfg;
	last_indent = 0;
/*依次写入各配置数据*/
	strcpy(buf,"\tversion=13022100");
	indent=0;
	key=buf;
}

static rt_err_t config_load(void)
{


}


static rt_err_t config_save(void)
{


}




/*保存参数到serialflash*/
void param_save( void )
{
	rt_kprintf("parma_save size=%d\r\n",sizeof(jt808_param));
	sst25_write_back(ADDR_PARAM,(uint8_t*)&jt808_param,sizeof(jt808_param));
}

/*加载参数从serialflash*/
void param_load( void )
{
	/*预读一部分数据*/
	uint8_t	ver8[4];
	uint32_t ver32;
	sst25_read(ADDR_PARAM,ver8,4);
	ver32=(ver8[0]<<24)|(ver8[1]<<16)|(ver8[2]<<8)|(ver8[3]);
	rt_kprintf("param_load ver=%08x\r\n",ver32);
	if(jt808_param.id_0x0000!=ver32)  /*不管是不是未初始化*/
	{
		rt_kprintf("%s(%d)\r\n",__func__,__LINE__);
		param_save();
	}
	sst25_read(ADDR_PARAM,(uint8_t*)&jt808_param,sizeof(jt808_param));
}



/*打印参数信息*/
void param_print(void)
{
	uint8_t tbl[16]={'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
	int i,count=0;
	uint8_t c;
	uint8_t *p=(uint8_t*)&jt808_param;
	uint8_t printbuf[70];
	int32_t len=sizeof(jt808_param);

	while(len>0)
	{
		count=(len<16)?len:16;
		memset(printbuf,0x20,70);
		for(i=0;i<count;i++) 
		{
			c=*p;
			printbuf[i*3]=tbl[c>>4];
			printbuf[i*3+1]=tbl[c&0x0f];
			if(c<0x20) c='.';
			if(c>0x7f) c='.';
			printbuf[50+i]=c;
			p++;
		}
		printbuf[69]=0;
		rt_kprintf("%s\r\n",printbuf);
		len-=count;
	}
}
FINSH_FUNCTION_EXPORT( param_print, print param );


/*
   $GNRMC,074001.00,A,3905.291037,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E
   $GNTXT,01,01,01,ANTENNA OK*2B7,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E
   $GNGGA,074002.00,3905.291085,N,11733.138264,E,1,11,0.9,8.2,M,-1.6,M,,,1.4*68E
   $GNGLL,3905.291085,N,11733.138264,E,074002.00,A,0*02.9,8.2,M,-1.6,M,,,1.4*68E
   $GPGSA,A,3,18,05,08,02,26,29,15,,,,,,,,,,,,,,,,,,,,,,,,,,1.6,0.9,1.4,0.9*3F8E
   $BDGSA,A,3,04,03,01,07,,,,,,,,,,,,,,,,,,,,,,,,,,,,,1.6,0.9,1.4,0.9*220.9*3F8E
   $GPGSV,2,1,7,18,10,278,29,05,51,063,32,08,21,052,24,02,24,140,45*4C220.9*3F8E
   $GPGSV,2,2,7,26,72,055,24,29,35,244,37,15,66,224,37*76,24,140,45*4C220.9*3F8E
   $BDGSV,1,1,4,04,27,124,38,03,42,190,34,01,38,146,37,07,34,173,35*55220.9*3F8E

   返回处理的字段数，如果正确的话
 */
uint8_t process_rmc( uint8_t *pinfo )
{
	//检查数据完整性,执行数据转换
	uint8_t		year = 0, mon = 0, day = 0, hour = 0, min = 0, sec = 0, fDateModify = 0;
	uint32_t	degrees, minutes;
	uint8_t		count;

	uint8_t		gps_time[10];
	uint8_t		gps_av	= 0;
	uint8_t		gps_ns	= 0;
	uint8_t		gps_ew	= 0;
	uint8_t		gps_latitude[16];
	uint8_t		gps_longitude[16];
	uint8_t		gps_speed[8];
	uint8_t		gps_direct[8];
	uint8_t		gps_date[8];

	uint8_t		*psrc = pinfo + 7; //指向开始位置
/*时间处理 */
	count = 0;
	while( ( *psrc != ',' ) && ( count < 10 ) )
	{
		gps_time[count++]	= *psrc;
		gps_time[count]		= 0;
		psrc++;
	}
	if( ( count == 0 ) || ( count == 10 ) )
	{
		return 0;
	}
	hour	= ( gps_time[0] - 0x30 ) * 10 + ( gps_time[1] - 0x30 ) + 8;
	min		= ( gps_time[2] - 0x30 ) * 10 + ( gps_time[3] - 0x30 );
	sec		= ( gps_time[4] - 0x30 ) * 10 + ( gps_time[5] - 0x30 );
	if( hour > 23 )
	{
		fDateModify = 1;
		hour		-= 24;
	}
	gpsinfo.datetime[3] = ( ( hour / 10 ) << 4 ) | ( hour % 10 );
	gpsinfo.datetime[4] = ( ( min / 10 ) << 4 ) | ( min % 10 );
	gpsinfo.datetime[5] = ( ( sec / 10 ) << 4 ) | ( sec % 10 );
/*A_V处理*/
	psrc++;
	if( ( *psrc == 'A' ) || ( *psrc == 'V' ) )
	{
		gps_av = *psrc;
	} else
	{
		return 1;
	}
	if( gps_av == 'A' )
	{
		jt808_status &= ~0x01;
	} else
	{
		jt808_status |= 0x01;
	}
/*纬度处理ddmm.mmmmmm*/
	psrc++;
	count = 0;
	while( ( *psrc != ',' ) && ( count < 11 ) )
	{
		gps_latitude[count++]	= *psrc;
		gps_latitude[count]		= 0;
		psrc++;
	}
	if( count == 0 )
	{
		return 2;
	}
	degrees = ( ( gps_latitude[0] - 0x30 ) * 10 + ( gps_latitude[1] - 0x30 ) ) * 60 * 100000;
	minutes = ( gps_latitude[2] - 0x30 ) * 1000000 +
	          ( gps_latitude[3] - 0x30 ) * 100000 +
	          ( gps_latitude[5] - 0x30 ) * 10000 +
	          ( gps_latitude[6] - 0x30 ) * 1000 +
	          ( gps_latitude[7] - 0x30 ) * 100 +
	          ( gps_latitude[8] - 0x30 ) * 10 +
	          ( gps_latitude[9] - 0x30 );

	gpsinfo.latitude = ByteSwap4( degrees + minutes );

/*N_S处理*/
	psrc++;
	if( ( *psrc == 'N' ) || ( *psrc == 'S' ) )
	{
		gps_ns = *psrc;
	} else
	{
		return 3;
	}
	if( gps_ns == 'N' )
	{
		jt808_status &= ~0x02;
	} else
	{
		jt808_status |= 0x02;
	}

/*经度处理*/
	psrc++;
	count = 0;
	while( ( *psrc != ',' ) && ( count < 12 ) )
	{
		gps_longitude[count++]	= *psrc;
		gps_longitude[count]	= 0;
		psrc++;
	}
	if( count == 0 )
	{
		return 4;
	}
	degrees = ( ( gps_latitude[0] - 0x30 ) * 100 + ( gps_latitude[1] - 0x30 ) * 10 + ( gps_latitude[2] - 0x30 ) ) * 60 * 100000;
	minutes = ( gps_latitude[3] - 0x30 ) * 1000000 +
	          ( gps_latitude[4] - 0x30 ) * 100000 +
	          ( gps_latitude[6] - 0x30 ) * 10000 +
	          ( gps_latitude[7] - 0x30 ) * 1000 +
	          ( gps_latitude[8] - 0x30 ) * 100 +
	          ( gps_latitude[9] - 0x30 ) * 10 +
	          ( gps_latitude[10] - 0x30 );
	gpsinfo.longitude = ByteSwap4( degrees + minutes );
/*N_S处理*/
	psrc++;
	if( ( *psrc == 'E' ) || ( *psrc == 'W' ) )
	{
		gps_ew = *psrc;
	} else
	{
		return 5;
	}
	if( gps_ew == 'E' )
	{
		jt808_status &= ~0x04;
	} else
	{
		jt808_status |= 0x04;
	}

/*速度处理*/
	psrc++;
	count = 0;
	while( ( *psrc != ',' ) && ( count < 7 ) )
	{
		gps_speed[count++]	= *psrc;
		gps_speed[count]	= 0;
		psrc++;
	}
	if( count == 0 )
	{
		return 6;
	}

/*方向处理*/
	psrc++;
	count = 0;
	while( ( *psrc != ',' ) && ( count < 7 ) )
	{
		gps_direct[count++] = *psrc;
		gps_direct[count]	= 0;
		psrc++;
	}
	if( count == 0 )
	{
		return 7;
	}

