GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/* 单包数据处理,不需要创建MsgNode */
	if(( nodedata->attr & 0x2000 )== 0 )
	{
		nodedata->pmsg = psrc + 15;                 /*消息体开始位置*/
		for( i = 0; i < sizeof( handle_jt808_rx_msg ) / sizeof( HANDLE_JT808_RX_MSG ); i++ )
		{
			if( nodedata->id == handle_jt808_rx_msg[i].id )
			{
				handle_jt808_rx_msg[i].func( nodedata );
				flag_find = 1;
			}
		}
		if( !flag_find )
		{
			handle_jt808_rx_default( nodedata );
		}
		rt_free( pinfo );
		rt_free( nodedata );
	}


/*检查是否有超时没有处理的信息，主要是多包信息
收到消息才会处理，如果长时间没有收到，占用内存
*/

	iter		= list_jt808_rx->first;
	flag_find	= 0;
	while( iter != NULL )
	{
		iterdata = iter->data;
		if( rt_tick_get( ) - iterdata->tick > RT_TICK_PER_SECOND * 10 ) /*超过10秒没有数据包*/
		{
			/*整理一下，准备删除该节点串*/
			if( iter->prev == NULL )                                    /*队首*/
			{
				list_jt808_rx->first = iter->next;
			}else
			{
				iter->prev->next = iter->next;
				if( iter->next != RT_NULL )
				{
					iter->next->prev = iter->prev;
				}
			}

			while( iter != NULL )
			{
				iter_tmp	= iter->next;
				iterdata	= iter->data;
				rt_free( iterdata->pmsg );
				rt_free( iterdata );
				rt_free( iter );
				iter = iter_tmp;
			}
		}
	}
/*不是多包,返回*/
	if(( nodedata->attr & 0x2000 )== 0 )
	{
		return 0;
	}


	

/*分包处理,创建新的节点*/
	node = msglist_node_create( (void*)nodedata );
	if( node == RT_NULL )
	{
		rt_free( nodedata );
		rt_free( pinfo );
		return 1;
	}
	nodedata->packetcount	= ( *( psrc + 12 ) << 8 ) | *( psrc + 13 );
	nodedata->packetno		= ( *( psrc + 14 ) << 8 ) | *( psrc + 15 );
/*看是不是第一个分包*/
	flag_find	= 0;
	iter		= list_jt808_rx->first;
	while( iter != NULL )
	{
		iterdata = (JT808_RX_MSG_NODEDATA*)( iter->data );
		if( iterdata->id == nodedata->id ) /*判断的消息ID一致,即便已有分包，但ID不一致，也认为是新包*/
		{
			flag_find = 1;
			break;
		}
		iter = iter->next;
	}
/*找到，不是第一个分包，要对已有的分包排序*/
	if( flag_find )                                     /*找到了 iter，开始遍历sibling并插入*/
	{
		if( iterdata->packetno < nodedata->packetno )   /*在主干上,改变主干上的节点*/
		{
			node->prev			= iter->prev;
			node->next			= iter->next;           /*替换原来的位置*/
			node->sibling_dn	= iter;
			iter->sibling_up	= node;
		}else /*在多包信息的分支上*/
		{
			flag_find = 0;
			while( iter->sibling_dn != NULL )
			{
				iter		= iter->sibling_dn;
				iterdata	= iter->data;
				if( iterdata->packetno < nodedata->packetno )
				{
					node->sibling_up	= iter->sibling_up;
					node->sibling_dn	= iter;
					iter->sibling_up	= node;
					flag_find			= 1;
					break;
				}
			}
			if( flag_find == 0 ) /*结尾也没有找到*/
			{
				node->sibling_up	= iter;
				iter->sibling_dn	= node;
			}
		}
	}else /*没找到，没有使用msglist_append(list_jt808_rx,nodedata);*/
	{
		if( list_jt808_rx->first == NULL )  /*是第一个节点*/
		{
			list_jt808_rx->first->data = nodedata;
		}else /*已有节点，添加到最后*/
		{
			iter		= iter->prev;       /*此时iter为NULL,应指向前一个有效node*/
			iter->next	= node;
			node->prev	= iter;
		}
	}
}

/*
   处理每个要发送信息的状态
   现在允许并行处理吗?
 */

static MsgListRet jt808_tx_proc( MsgListNode* node )
{
	MsgListNode				* pnode		= (MsgListNode*)node;
	JT808_TX_MSG_NODEDATA	* pnodedata = (JT808_TX_MSG_NODEDATA*)( pnode->data );
	int i;
		 

	if( node == RT_NULL ) return MSGLIST_RET_OK;
	
	if( pnodedata->state == IDLE )                      /*空闲，发送信息或超时后没有数据*/
	{
		if( pnodedata->retry >= jt808_param.id_0x0003 )  /*已经达到重试次数*/
		{
			/*表示发送失败*/
			pnodedata->cb_tx_timeout( pnodedata );			/*调用发送失败处理函数*/
			return MSGLIST_RET_DELETE_NODE;
		}
		else
		{
			
			//rt_device_write( pdev_gsm, 0, pnodedata->pmsg, pnodedata->msg_len );
			gsm_ipsend(pnodedata->pmsg, pnodedata->msg_len,jt808_param.id_0x0002*RT_TICK_PER_SECOND);
			pnodedata->tick		= rt_tick_get( );
			pnodedata->retry++;
			pnodedata->timeout	= pnodedata->retry * jt808_param.id_0x0002*RT_TICK_PER_SECOND;
			pnodedata->state	= WAIT_ACK;
			rt_kprintf( "send retry=%d,timeout=%d\r\n", pnodedata->retry, pnodedata->timeout*10 );			
			
		}
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == WAIT_ACK )
	{
		if( rt_tick_get( ) - pnodedata->tick > pnodedata->timeout )
		{
			pnodedata->state = IDLE;
		}
	}

	if( pnodedata->state == ACK_OK )        /*收到ACK，在接收中置位*/
	{
		//pnodedata->cb_tx_response( pnodedata );
		return MSGLIST_RET_DELETE_NODE;
	}

	return MSGLIST_RET_OK;
}





/*
判断一个字符串是不是表示ip的str
如果由[0..9|.] 组成

'.' 0x2e
'/' 0x2f
'0' 0x30
'9' 0x39
简化一下。不判断 '/'
*/
static uint8_t is_ipstr(char * str)
{
	char *p=str;
	while(*p!=NULL)
	{
		if((*p>'9')||(*p<'.')) return 0;
		p++;
	}
	return 1;
}


/*jt808的socket管理

维护链路。会有不同的原因
上报状态的维护
1.尚未登网
2.中心连接，DNS,超时不应答
3.禁止上报，关闭模块的区域
4.当前正在进行空中更新，多媒体上报等不需要打断的工作

*/
static void jt808_socket_proc( void )
{
	volatile uint32_t state;
	static rt_tick_t lasttick;
	static uint8_t		flag_connect=0;

	if(flag_disable_report) return;
/*检查GSM状态*/
	state=config_gsmstate(0);
	if(state==GSM_IDLE)
	{
		if(flag_connect==0) /*连接主server*/
		{
			curr_gsm_socket.apn=jt808_param.id_0x0010;
			curr_gsm_socket.user=jt808_param.id_0x0011;
			curr_gsm_socket.psw=jt808_param.id_0x0012;
			curr_gsm_socket.type='t';
			if(is_ipstr(jt808_param.id_0x0013))
				strcpy(curr_gsm_socket.ip_str,jt808_param.id_0x0013);
			else
				curr_gsm_socket.ip_domain=jt808_param.id_0x0013;
			curr_gsm_socket.port=jt808_param.id_0x0018;
			rt_kprintf("\r\napn=%s\r\n",curr_gsm_socket.apn);
		}
		else
		{
			curr_gsm_socket.apn=jt808_param.id_0x0014;
			curr_gsm_socket.user=jt808_param.id_0x0015;
			curr_gsm_socket.psw=jt808_param.id_0x0016;
			curr_gsm_socket.type='t';
			if(is_ipstr(jt808_param.id_0x0017))
				strcpy(curr_gsm_socket.ip_str,jt808_param.id_0x0017);
			else
				curr_gsm_socket.ip_domain=jt808_param.id_0x0017;

			curr_gsm_socket.port=jt808_param.id_0x0018;
		}
		curr_gsm_socket.state=SOCKET_IDLE;
		config_gsmstate(GSM_POWERON);
		return;
	}
	if(state==GSM_POWERON) /*检查超时*/
	{

	}
	if(state!=GSM_AT) return;


/*检查socket状态,判断用不用DNS*/	
	switch(curr_gsm_socket.state)
	{
		case SOCKET_IDLE:
			if(flag_connect==0)
			{
				if(is_ipstr(jt808_param.id_0x0013)) 
					curr_gsm_socket.state=SOCKET_CONNECT;
				else
					curr_gsm_socket.state=SOCKET_DNS;
			}	
			else
			{
				if(is_ipstr(jt808_param.id_0x0017)) 
					curr_gsm_socket.state=SOCKET_CONNECT;
				else
					curr_gsm_socket.state=SOCKET_DNS;
			}
			break;
		case SOCKET_CONNECT_ERR:
		case SOCKET_DNS_ERR:
			flag_connect++;
			if(flag_connect==2)				/*是否要关闭设备，重新启动链接*/
			{
				flag_connect=0;
			}
			config_gsmstate(GSM_POWEROFF); /*关闭gsm等待重连*/
			break;

