GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
	}
	if(state!=SOCKET_READY) return;
/*是否发送数据*/	


}



/*
   连接状态维护
   jt808协议处理

 */
ALIGN( RT_ALIGN_SIZE )
static char thread_jt808_stack[4096];
struct rt_thread thread_jt808;

/***/
static void rt_thread_entry_jt808( void* parameter )
{
	rt_err_t	ret;
	int 		i;
	uint8_t		*pstr;
	

	MsgListNode * iter;
	MsgListNode * iter_next;
	JT808_TX_MSG_NODEDATA* pnodedata;

//	for(i=0;i<MAX_GSM_SOCKET;i++) gsm_socket[i].msglist_tx = msglist_create();

	config_init();
	

	PT_INIT( &pt_jt808_socket );

/*读取参数，并配置*/
	param_load();

	param_print();

	list_jt808_tx	= msglist_create( );
	list_jt808_rx	= msglist_create( );

	pdev_gsm = rt_device_find( "gsm" ); /*没有出错处理,未找到怎么办*/



	while( 1 )
	{
/*接收gps信息*/
		ret = rt_mb_recv( &mb_gpsdata, (rt_uint32_t*)&pstr, 5 );
		if( ret == RT_EOK )
		{
			gps_analy( pstr );
			rt_free( pstr );
		}
/*接收gprs信息*/
		ret = rt_mb_recv( &mb_gprsdata, (rt_uint32_t*)&pstr, 5 );
		if( ret == RT_EOK )
		{
			jt808_rx_proc( pstr );
		}
/*jt808 socket处理*/
		jt808_socket_proc();
/*逐条处理*/
		iter = list_jt808_tx->first;
		if( jt808_tx_proc( iter ) == MSGLIST_RET_DELETE_NODE )	/*删除该节点*/
		{
			pnodedata=(JT808_TX_MSG_NODEDATA*)(iter->data);
			rt_free( pnodedata->pmsg ); 					/*删除用户数据*/
			rt_free(pnodedata); 							/*删除节点数据*/
			list_jt808_tx->first=iter->next;				/*指向下一个*/
			rt_free( iter );
		}


		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}

	msglist_destroy( list_jt808_tx );
}

/*jt808处理线程初始化*/
void jt808_init( void )
{

	rt_mb_init( &mb_gprsdata, "gprsdata", &mb_gprsdata_pool, MB_GPRSDATA_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_gpsdata, "gpsdata", &mb_gpsdata_pool, MB_GPSDATA_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_jt808,
	                "jt808",
	                rt_thread_entry_jt808,
	                RT_NULL,
	                &thread_jt808_stack[0],
	                sizeof( thread_jt808_stack ), 10, 5 );
	rt_thread_startup( &thread_jt808 );
}

/*gps接收处理*/
void gps_rx( uint8_t *pinfo, uint16_t length )
{
	uint8_t *pmsg;
	pmsg = rt_malloc( length + 2 );
	if( pmsg != RT_NULL )
	{
		pmsg[0] = length >> 8;
		pmsg[1] = length & 0xff;
		memcpy( pmsg + 2, pinfo, length );
		rt_mb_send( &mb_gpsdata, (rt_uint32_t)pmsg );
	}
}

/*gprs接收处理,收到数据要尽快处理*/
rt_err_t gprs_rx( uint8_t linkno, uint8_t * pinfo, uint16_t length )
{
	uint8_t *pmsg;
	pmsg = rt_malloc( length + 3 ); /*包含长度信息*/
	if( pmsg != RT_NULL )
	{
		pmsg[0] = linkno;
		pmsg[1] = length >> 8;
		pmsg[2] = length & 0xff;
		memcpy( pmsg + 3, pinfo, length );
		rt_mb_send( &mb_gprsdata, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

FINSH_FUNCTION_EXPORT( gprs_rx, simlute gprs rx );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t gprs_tx( uint8_t linkno, uint8_t * pinfo, uint16_t length )
{
	uint8_t *pmsg;
	pmsg = rt_malloc( length + 3 ); /*包含长度信息*/
	if( pmsg != RT_NULL )
	{
		pmsg[0] = linkno;
		pmsg[1] = length >> 8;
		pmsg[2] = length & 0xff;
		memcpy( pmsg + 3, pinfo, length );
		rt_mb_send( &mb_gprsdata, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

FINSH_FUNCTION_EXPORT( gprs_tx, simlute gprs tx );




rt_err_t server(uint8_t cmd,char* apn,char* name,char* psw)
{
	if(cmd==0) /*打印参数*/
	{
		rt_kprintf("\r\napn=%s user=%s psw=%s ip_domain=%s tcp_port=%d udp_port=%d",
					jt808_param.id_0x0010,
					jt808_param.id_0x0011,
					jt808_param.id_0x0012,
					jt808_param.id_0x0013,
					jt808_param.id_0x0018,
					jt808_param.id_0x0019
					);
		rt_kprintf("\r\napn=%s user=%s psw=%s ip_domain=%s tcp_port=%d udp_port=%d\r\n",
					jt808_param.id_0x0014,
					jt808_param.id_0x0015,
					jt808_param.id_0x0016,
					jt808_param.id_0x0017,
					jt808_param.id_0x0018,
					jt808_param.id_0x0019
					);

		
	}
	if(cmd==1) /*设置主server*/
	{


	}
	if(cmd==2) /*设置备份server*/
	{


	}
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( server, config server );



static uint16_t jt808_pack_byte(uint8_t *buf,uint8_t *fcs,uint8_t data)
{
	uint8_t *p=buf;
	*fcs^=data;
	if((data==0x7d)||(data==0x7e))
	{
		*p++ = 0x7d;
		*p = (data-0x7c);
		return 2;
	}
	else
	{
		*p = data;
		return 1;
	}	
}

/*
static uint16_t jt808_pack_word(uint8_t *buf,uint8_t *fcs,uint16_t data)
{
	uint16_t count=0;
	count+=jt808_pack_byte(buf+count,fcs,(data>>8));
	count+=jt808_pack_byte(buf+count,fcs,(data&0xff));
	return count;
}

static uint16_t jt808_pack_dword(uint8_t *buf,uint8_t *fcs,uint32_t data)
{
	uint16_t count=0;
	count+=jt808_pack_byte(buf+count,fcs,(data>>24));
	count+=jt808_pack_byte(buf+count,fcs,(data>>16));
	count+=jt808_pack_byte(buf+count,fcs,(data>>8));
	count+=jt808_pack_byte(buf+count,fcs,(data&0xff));
	return count;
}
*/

/*传递进长度，便于计算*/
static uint16_t jt808_pack_int(uint8_t *buf,uint8_t *fcs,uint32_t data,uint8_t width )
{
	uint16_t count=0;
	switch(width)
	{
		case 1:
			count+=jt808_pack_byte(buf+count,fcs,(data&0xff));
			break;
		case 2:
			count+=jt808_pack_byte(buf+count,fcs,(data>>8));
			count+=jt808_pack_byte(buf+count,fcs,(data&0xff));
			break;
		case 4:
			count+=jt808_pack_byte(buf+count,fcs,(data>>24));	
			count+=jt808_pack_byte(buf+count,fcs,(data>>16));
			count+=jt808_pack_byte(buf+count,fcs,(data>>8));
			count+=jt808_pack_byte(buf+count,fcs,(data&0xff));
			break;
	}
	return count;
}






static uint16_t jt808_pack_string(uint8_t *buf,uint8_t *fcs,char *str)
{
	uint16_t count=0;
	char *p=str;
	while(*p)
	{ 
		count+=jt808_pack_byte(buf+count,fcs,*p++);
	}
	return count;
}

static uint16_t jt808_pack_array(uint8_t *buf,uint8_t *fcs,uint8_t *src,uint16_t len)
{
	uint16_t count=0;
	int i;
	char *p=src;
	for(i=0;i<len;i++)
	{ 
		count+=jt808_pack_byte(buf+count,fcs,*p++);
	}
	return count;
}

static rt_err_t jt808_tx( void )
{
	uint8_t					*pdata;
	JT808_TX_MSG_NODEDATA	*pnodedata;
	uint8_t					buf[256];
	uint8_t					*p;
	uint16_t				len;
	uint8_t fcs=0;
	int i;

	pnodedata = rt_malloc( sizeof( JT808_TX_MSG_NODEDATA ) );
	if( pnodedata == NULL )
	{
		return -1;
	}
	pnodedata->type		= TERMINAL_CMD; /*发送即删除，其他不用配置*/
	pnodedata->state	= IDLE;
	pnodedata->retry=0;
	pnodedata->cb_tx_timeout=jt808_tx_timeout;
	pnodedata->cb_tx_response=jt808_tx_response;

	len=1;
	len+=jt808_pack_int(buf+len,&fcs,0x0100,2);
	len+=jt808_pack_int(buf+len,&fcs,37+strlen(jt808_param.id_0x0083),2);
	len+=jt808_pack_array(buf+len,&fcs,term_param.mobile,6);
	len+=jt808_pack_int(buf+len,&fcs,tx_seq,2);
	
	len+=jt808_pack_int(buf+len,&fcs,jt808_param.id_0x0081,2);
	len+=jt808_pack_int(buf+len,&fcs,jt808_param.id_0x0082,2);
	len+=jt808_pack_array(buf+len,&fcs,term_param.producer_id,5);
	len+=jt808_pack_array(buf+len,&fcs,term_param.model,20);
	len+=jt808_pack_array(buf+len,&fcs,term_param.terminal_id,7);
	len+=jt808_pack_int(buf+len,&fcs,jt808_param.id_0x0084,1);
	len+=jt808_pack_string(buf+len,&fcs,jt808_param.id_0x0083);
	len+=jt808_pack_byte(buf+len,&fcs,fcs);
	buf[0]=0x7e;
	buf[len]=0x7e;
	pdata	= rt_malloc( len+1 );
	if( pdata == NULL )
	{
		rt_free( pnodedata );
		return;
	}
	rt_kprintf("\r\n--------------------\r\n");
	for(i=0;i<len+1;i++) rt_kprintf("%02x ",buf[i]);
	rt_kprintf("\r\n--------------------\r\n");
	memcpy( pdata, buf, len+1 );
	pnodedata->msg_len	= len+1;
	pnodedata->pmsg		= pdata;
	pnodedata->head_sn=tx_seq;
	pnodedata->head_id= 0x0100;
	msglist_append( list_jt808_tx, pnodedata );
	tx_seq++;
}

FINSH_FUNCTION_EXPORT( jt808_tx, jt808_tx test );






/************************************** The End Of File **************************************/

